export const value = [
  {
    title: "آرایه‌ها",
    text: [
      'در قسمت های قبل با ابزار های کار با اعداد و مقادیر true و false آشنا شدیم. در این قسمت با آرایه‌ها یا لیست‌ها آشنا می شویم.',
      'آرایه‌ها فهرستی از مقدار های دیگرند. برای ساختن یک آرایه، ساده ترین کار این است که آن‌ها را درون [] بنویسیم و با , جدا کنیم.',
      'برای مثال برنامه رو به رو دو چیز ورودی می گیرد و یک آرایه سه تایی بر می‌گرداند.',
      'هر مقداری را می توان درون آرایه قرار داد. برای مثال در ورودی رو به رو در قسمت اول آرایه عدد ۲ و در قسمت سوم آرایه [1,2,5] قرار می‌گیرد.',
      'برای رد کردن این مرحله، برنامه‌ای بنویسید که یک عدد ورودی بگیرد و پنج عدد متوالی با شروع از آن را خروجی دهد.',
    ],
    default: {
      "code": 
`(x,y) => [x, 5, y]`
      ,
      "input": "2, [1,2,5]",
    },
    test: [1,2,-5,100],
    judge: (x) => [x, x+1, x+2, x+3, x+4],
  },
  {
    title: "نوشته ها با ``",
    text: [
      'از میان سه علامتی که می‌توان با آن نوشته ها را مشخص کرد، `` خواص ویژه ای دارد:',
      '1- می توانید رشته هایی در چند خط تولید کنید.',
      '2- می توانید مقادیر عادی مثل اعداد، مقادیر بولی یا رشته های دیگر را درون ${} بنویسید. نتیجه به صورت خودکار تبدیل به رشته می شود و در جایگاه قرار می گیرد.',
      'برنامه رو به رو از این قابلیت ها استفاده می کند. می توانید دکمه تست را بزنید تا نتیجه را ببینید.',
      'برای رد کردن این مرحله برنامه ای بنویسید که دو رشته از ورودی بگیرد و آن‌ها را به هم بچسباند.',
      'مثال: ورودی = "سلام", "علیک"',
      "خروجی = 'سلامعلیک'",
    ],
    default: {
      "code": 
`(v1, v2, v3) => 
\` مقدار خروجی به شرح زیر است:
ورودی اول: \${v1}
ورودی دوم: \${v2}
ورودی سوم: \${v3}
جمع ورودی اول با ورودی دوم: \${v1+v2}
\${ 
    v1 > v2 
  ?
    'ورودی اول از ورودی دوم بزرگتر است' 
  :
    'ورودی دوم از ورودی اول بزرگتر است'
  }
\`
`
      ,
      input: '12, 28 , "salam"',
    },
    test: [["salam","aleyk"],["سلام ","علیک"]],
    judge: (x, y) => x + y,
  },
  
];