export const value = [
  {
    title: "شاخص توده بدنی",
    text: [
      'شاخص توده بدنی میزان چاقی شما را حساب می کند. این شاخص از طریق تقسیم وزن فرد بر حسب کیلوگرم به قد فرد بر حسب متر ضرب در خودش به دست می آید.',
      'درباره <a href="https://fa.wikipedia.org/wiki/%D8%B4%D8%A7%D8%AE%D8%B5_%D8%AA%D9%88%D8%AF%D9%87_%D8%A8%D8%AF%D9%86%DB%8C">شاخص توده بدنی</a> بیشتر بدانید.',
      'برنامه ای بنوسید که در ورودی به ترتیب وزن بر حسب کیلوگرم و قد بر حسب <strong>سانتی متر</strong> را دریافت کرده و این شاخص را محاسبه کند.'
    ],
    default: {
      "code": "(vazn, ghad) => vazn/(ghad*ghad)",
      "input": "62, 183",
    },
    test: [[100,200]],
    judge: (vazn, ghad) => vazn/(ghad*ghad/10000),
  },
];