export const value = [
  {
    title: "مقادیر بولی",
    text: [
      'برنامه هایی که ما می نویسیم با چیز های متفاوتی می تواند کار کند. در قسمت قبل مثال هایی از کار با اعداد را دیدیم',
      'در این قسمت با مقادیر بولی آشنا می شویم. علاوه بر اعداد، خروجی برنامه ها می تواند true یا false نیز باشد.',
      'منظور از true در برنامه نویسی، درست بودن یا آری بودن یک مقدار است و به طور مشابه، منظور از false نادرستی یا خیر بودن است.',
      'برنامه رو به رو چیزی یک چیز از ورودی می گیرد و مستقل از این که آن چیز چه باشد، true بر می گرداند.',
      'شما باید true را به false تبدیل کنید تا به مرحله بعدی بروید.',
    ],
    default: {
      "code": "(x) => true",
      "input": "5.5",
    },
    test: [[1],[2],[3],[4],[5], [2.1], [2.2], [2.7], [2.8]],
    judge: (x)=>false,
  },
  {
    title: "مقایسه اعداد",
    text: [
      'در قسمت قبل با انجام اعمال ریاضی + و * روی اعداد آشنا شدیم. در این قسمت با عملگر های مقایسه‌ای آشنا می‌شویم.',
      'مقایسه اعداد به وسیله عملگر های > و < انجام می‌شود. خروجی این عملگر ها اگر نتیحه مقایسه درست باشد true وگرنه false است.',
      'برنامه رو به رو را به ازای ورودی های متفاوت اجرا کنید و نتیجه را ببینید.',
      'سپس برنامه ای بنویسید که دو ورودی بگیرد و تشخیص دهد که آیا ورودی اول از دو برابر ورودی دوم بزرگتر است یا خیر.',
      'یعنی برنامه شما باید اگر ورودی اول از دو برابر ورودی دوم بزرگتر بود true و در غیر این صورت false برگرداند.'
    ],
    default: {
      "code": "(x) => x + 2 > 7",
      "input": "5.5",
    },
    test: [[1,1],[2,1],[3,1],[4,2],[5,2], [2.1,1], [2.2,1.1], [2.7,1.5], [2.8, 1.1]],
    judge: (x,y) => x > 2*y,
  },
  {
    title: "عملگر a?b:c",
    text: [
      'عملگری که در این درس با آن آشنا می شویم یک عملگر سه تایی است. عملگرهای قسمت پیش دوتایی بودند.',
      'در عملگر a?b:c مقدار a باید true یا false باشد.',
      'نتیجه این عملگر اگر مقدار a برابر true باشد b و در غیر این صورت c خواهد بود.',
      'این عملگر به کامپیوتر کمک می کند تا در شرایط مختلف بتواند تصمیمات متفاوتی بگیرد.',
      'برنامه رو به رو سه ورودی می گیرد که ورودی اول حتما باید عدد باشد. سپس بررسی می کند که ورودی اول از پنج بزرگتر است یا نه. اگر بزرگتر بود ورودی دوم و در غیر این صورت ورودی سوم را برمی‌گرداند.',
      'توجه کنید که علاوه بر اعداد، می توان مقادیر true و false را نیز به عنوان ورودی به برنامه داد.',
      'حال برنامه‌ای بنویسید که دو عدد از ورودی بگیرد، اگر جمع آن دو از ۱۰۰۰ بیشتر بود true و در غیر این صورت اختلاف جمع آن دو با ۱۰۰۰ را برگرداند.',
    ],
    default: {
      "code": "(x,y,z) => \n  x > 5 \n?\n  y\n:\n  z",
      "input": "6, 1000, false",
    },
    test: [[1, 1000], [500, 501], [12, 56], [4444, 2], [500, 500]],
    judge: (x, y)=> x+y>1000 ? true : 1000-(x+y),
  },
];