export const value = [
  {
    title: "مقایسه اعداد و شرط ها",
    text: [
      'برنامه هایی که ما می نویسیم با چیز های متفاوتی می تواند کار کند. در قسمت قبل مثال هایی از کار با اعداد را دیدیم',
      'در این قسمت با مقادیر بولی آشنا می شویم. علاوه بر اعداد، خروجی برنامه ها می تواند true یا false نیز باشد. با امتحان کردن برنامه رو به رو با ورودی های مختلف، منظور از این مقادیر را بفهمید.',
      'عملگر های < و > و => و =< برای مقایسه اعداد به کار می روند. (علامت بزرگتر مساوی را با علامت فلش برای تعریف برنامه اشتباه نگیرید) اگر نتیجه مقایسه درست باشد، نتیجه true و در غیر این صورت نتیجه false می شود.',
      'برای رد کردن این مرحله، برنامه ای بنویسید که یک عدد از ورودی بگیرد و تعیین کند که آیا ضرب آن در خودش از جمع آن با پنج بزرگ تر است یا نه',
    ],
    default: {
      "code": "(x)=>x>5",
      "input": "5.5",
    },
    test: [[1],[2],[3],[4],[5], [2.1], [2.2], [2.7], [2.8]],
    judge: (x)=>x*x>x+5,
  },
  {
    title: "مقایسه اعداد و شرط ها",
    text: [
      'همان گونه که می توانیم اعمال زیاضی را روی اعداد انجام دهیم، می توانیم مقادیر بولی را نیز به وسیله عملگر هایی با هم ترکیب کنیم.',
      'عملگر && به معنی "و منطقی" است و خروجی آن در صورتی true است که هر دو طرف true باشد',
      'عملگر || به معنی "یا منطقی" است و خروجی آن در صورتی true است که حداقل یکی از دو طرف true باشد',
      'عملگر ! هم عملگری است که مقدار بولی جلویش را برعکس می کند.',
      'برای رد کردن این مرحله، برنامه ای بنویسید که تشخیص دهد عدد ورودی در بازه ۵ تا ۱۰ قرار دارد یا نه(خود ۵ و ۱۰ نیز حساب هستند)',
    ],
    default: {
      "code": "(x, y, z)=> (x && !y) || z",
      "input": "true, false, true",
    },
    test: [[1],[2],[6],[4],[5], [10], [4.9], [10.1], [9.9]],
    judge: (x)=> x >= 5 && x <= 10,
  },
];