export const value = [
  {
    title: "مقایسه اعداد و مقادیر بولی",
    text: [
      'برنامه هایی که ما می نویسیم با چیز های متفاوتی می تواند کار کند. در قسمت قبل مثال هایی از کار با اعداد را دیدیم',
      'در این قسمت با مقادیر بولی آشنا می شویم. علاوه بر اعداد، خروجی برنامه ها می تواند true یا false نیز باشد. با امتحان کردن برنامه رو به رو با ورودی های مختلف، منظور از این مقادیر را بفهمید.',
      'عملگر های < و > و => و =< برای مقایسه اعداد به کار می روند. (علامت بزرگتر مساوی را با علامت فلش برای تعریف برنامه اشتباه نگیرید) اگر نتیجه مقایسه درست باشد، نتیجه true و در غیر این صورت نتیجه false می شود.',
      'برای رد کردن این مرحله، برنامه ای بنویسید که یک عدد از ورودی بگیرد و تعیین کند که آیا ضرب آن در خودش از جمع آن با پنج بزرگ تر است یا نه',
    ],
    default: {
      "code": "(x)=>x>5",
      "input": "5.5",
    },
    test: [[1],[2],[3],[4],[5], [2.1], [2.2], [2.7], [2.8]],
    judge: (x)=>x*x>x+5,
  },
  {
    title: "ترکیب مقادیر بولی به وسیله عملگر های منطقی",
    text: [
      'همان گونه که می توانیم اعمال زیاضی را روی اعداد انجام دهیم، می توانیم مقادیر بولی را نیز به وسیله عملگر هایی با هم ترکیب کنیم.',
      'عملگر && به معنی "و منطقی" است و خروجی آن در صورتی true است که هر دو طرف true باشد',
      'عملگر || به معنی "یا منطقی" است و خروجی آن در صورتی true است که حداقل یکی از دو طرف true باشد',
      'عملگر ! هم عملگری است که مقدار بولی جلویش را برعکس می کند.',
      'برای رد کردن این مرحله، برنامه ای بنویسید که تشخیص دهد عدد ورودی در بازه ۵ تا ۱۰ قرار دارد یا نه(خود ۵ و ۱۰ نیز حساب هستند)',
    ],
    default: {
      "code": "(x, y, z)=> (x && !y) || z",
      "input": "true, false, true",
    },
    test: [[1],[2],[6],[4],[5], [10], [4.9], [10.1], [9.9]],
    judge: (x)=> x >= 5 && x <= 10,
  },
  {
    title: "عملگر a?b:c",
    text: [
      'یکی دیگر از استفاده های مقادیر بولی، استفاده از آن‌ها در عملگر شرط است.',
      'عبارت a?b:c اگر مقدار a برابر true باشد برابر b و در غیر این صورت برابر c می‌شود',
      'مثلا تابع رو به رو اگر عدد ورودی به آن از ۵ بزرگ تر باشد، آن عدد به علاوه ۲ را بر می‌گرداند و در غیر این صورت false را بر می‌گرداند.',
      'برای رد کردن این مرحله، برنامه ای بنویسید که دو عدد ورودی بگیرد و اگر جمع آن ها از ۱۰۰۰ بیشتر بود true و در غیر این صورت اختلاف جمع آن‌ها با ۱۰۰۰ را برگرداند.',
    ],
    default: {
      "code": "(x) => \n  x > 5 \n?\n  x+2\n:\n  false",
      "input": "6",
    },
    test: [[1, 1000], [500, 501], [12, 56], [4444, 2], [500, 500]],
    judge: (x, y)=> x+y>1000 ? true : 1000-(x+y),
  },
];