export const value = [
  {
    title: "ماکسیمم دو عدد",
    text: [
      'حال بیایید ببینیم چقدر می‌توانید از دانسته هایتان استفاده کنید.',
      'برنامه‌ای بنویسید که دو عدد ورودی بگیرد و عدد بزرگ‌تر را خروجی دهد.',
    ],
    default: {
      "code": "(a, b) => ( a + 2 * b > 73 ? 24 : !false || true )",
      "input": "24.6, 9.3",
    },
    test: Array(100).fill().map((_,i)=>[(i*313)%777, (i*414)%853]),
    judge: Math.max,
  },
  {
    title: "ماکسیمم سه عدد",
    text: [
      'خوب بود! اما هنوز تمام نشده.',
      'برنامه‌ای بنویسید که سه عدد ورودی بگیرد و عدد بزرگ‌تر را خروجی دهد.',
    ],
    default: {
      "code": "(a, b, c) => ( a + 2 * b > 73 ? (c>2 ? 5 : 10) : !false || true )",
      "input": "24.6, 9.3, 3",
    },
    test: Array(100).fill().map((_,i)=>[(i*313)%777, (i*414)%853, i*10]),
    judge: Math.max,
  },
  {
    title: "قدر مطلق یک عدد",
    text: [
      'و غول مرحله آخر',
      'قدر مطلق یک عدد، برابر فاصله آن عدد از صفر است. مثلا قدر مطلق ۲ برابر ۲ و قدر مطلق -7.3 برابر ۷.۳ است'
    ],
    default: {
      "code": "(a) => ( a*(-1) )",
      "input": "24.6, 9.3",
    },
    test: Array(100).fill().map((_,i)=>[i-50]),
    judge: Math.abs,
  },
  
];