export const value = [
  {
    title: "اولین برنامه ما",
    text: [
      "هر برنامه کامپیوتری یک سری ورودی می گیرد و بعد از محاسباتی آن را به خروجی تبدیل می کند",
      "نحوه دریافت ورودی و خروجی برنامه های مختلف یکسان است. مثلا می توان ورودی را بوسیله ماوس دریافت کرد و خروجی را به وسیله صدا پخش کرد. اما قالب همه برنامه های کامپیوتری یکسان است",
      "در این سری برنامه هایی که ما با آن سر و کار داریم، ورودی و خروجی را به صورت متن در کادر مقابل نشان می‌دهند.",
      "ورودی را تغییر دهید و تغییرات خروجی را مشاهده کنید. با کلیک بر روی دکمه تست خروجی به روز می شود.",
      "برنامه مقابل همانطور که پیداست یک عدد از ورودی می گیرد و آن را با ۲ جمع می کند. محتوای قبل فلش که درون پرانتز قرار می‌گیرد نامی است که ما به ورودی اختصاص می دهیم. برای مثال نام input را به baghali تغییر دهید و نتیجه را بررسی کنید.",
      "حال با چیز هایی که در این درس یاد گرفتید برنامه ای بنویسید که یک عدد ورودی بگیرد و ضرب آن در خودش را محاسبه کند."
    ],
    default: {
      "code": "(input)=>input+2",
      "input": "5"
    },
    test: new Array(100).fill().map((_,i)=>[i]),
    judge: (x)=>x*x,
  },
  {
    title: "برنامه ای با چند ورودی",
    text: [
      "برنامه ها می توانند چند ورودی بگیرند. مثال رو به رو دو عدد دریافت می کند و نسبت ضرب به جمعشان را محاسبه می کند.",
      "حال شما برنامه ای بنویسید که سه عدد ورودی بگیرد و میانگین آن ها را محاسبه کند."
    ],
    default: {
      "code": "(x, y)=>(x*y)/(x+y)",
      "input": "4, 6"
    },
    test: new Array(100).fill().map((_,i)=>[i, 2*i+7, -i+20]),
    judge: (x,y,z)=>(x+y+z)/3,
  },
];